fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_УчетОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АнализГрафика();
	ЗаполнитьСотрудников();

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	
	ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.ПревышениеЛимита");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
	
	ПересчитатьЛимитыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ПересчитатьЛимитыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ПересчитатьЛимитыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент) Экспорт
	
	ПересчитатьЛимитыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АнализГрафика()
	
	ИмяКоманды = "АнализГрафика";
	КомандаЗаполнения = Команды.Добавить(ИмяКоманды);
	КомандаЗаполнения.Действие  = "АнализГрафикаНаКлиенте";
	КомандаЗаполнения.Заголовок = "Анализ графика";
	 
	ЭлементПанель = Элементы.ГодАнализ; 
	НоваяКнопка = Элементы.Добавить("КнопкаАнализГрафика", Тип("КнопкаФормы"), ЭлементПанель);
	НоваяКнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСотрудников()

	ИмяКоманды = "ЗаполнитьСотрудников";
	КомандаЗаполнения = Команды.Добавить(ИмяКоманды);
	КомандаЗаполнения.Действие  = "ЗаполнитьСотрудниковНаКлиенте";
	КомандаЗаполнения.Заголовок = "Заполнить сотрудников";
	 
	ЭлементПанель = Элементы.ОтпускаСотрудниковКоманднаяПанель; 
	НоваяКнопка = Элементы.Добавить("КнопкаЗаполнитьСотрудников", Тип("КнопкаФормы"), ЭлементПанель);
	НоваяКнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафикаНаКлиенте(Команда) Экспорт
	
	АдресВХранилище = ПоместитьВоВременноеХранилищеНаСервере();
	ПараметрыФормы = Новый Структура("АдресВХранилище", АдресВХранилище);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры


&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()

	Адрес = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить( ,
        "Сотрудник,ДатаНачала,ДатаОкончания"), УникальныйИдентификатор);
    Возврат Адрес;

КонецФункции

&НаКлиенте
Процедура ЗаполнитьСотрудниковНаКлиенте(Команда) Экспорт
	ЗаполнитьСотрудниковНаСервере();
	ПересчитатьЛимитыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСотрудниковНаСервере()
	
	Объект.ОтпускаСотрудников.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ПометкаУдаления
		|	И НЕ Пользователи.Наименование ПОДОБНО ""%Не указан%""
		|	И НЕ Пользователи.Наименование ПОДОБНО ""%Сервер%""";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ОтпускаСотрудников.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		
		Если ЗначениеЗаполнено(Объект.Год) Тогда
			НоваяСтрока.ДатаНачала = Дата(Объект.Год, 1, 1);
			НоваяСтрока.ДатаОкончания = Дата(Объект.Год, 1, 1);
		КонецЕсли;
	КонецЦикла;


КонецПроцедуры

&НаСервере
Процедура ПересчитатьЛимитыНаСервере()
	
	Для Каждого СтрокаФормы Из Объект.ОтпускаСотрудников Цикл
		Если ЗначениеЗаполнено(СтрокаФормы.ДатаНачала) И ЗначениеЗаполнено(СтрокаФормы.ДатаОкончания) Тогда
			СтрокаФормы.КоличествоДнейВДокументе = (НачалоДня(СтрокаФормы.ДатаОкончания) - НачалоДня(СтрокаФормы.ДатаНачала)) / 86400 + 1;
		Иначе
			СтрокаФормы.КоличествоДнейВДокументе = 0;
		КонецЕсли;
	КонецЦикла;
	
	ТЗ_Итоги = Объект.ОтпускаСотрудников.Выгрузить();
	ТЗ_Итоги.Свернуть("Сотрудник", "КоличествоДнейВДокументе");
	
	Для Каждого СтрокаФормы Из Объект.ОтпускаСотрудников Цикл
		Если Не ЗначениеЗаполнено(СтрокаФормы.Сотрудник) Тогда
			СтрокаФормы.ПревышениеЛимита = Ложь;
			Продолжить;
		КонецЕсли;
		
		СтрокаИтога = ТЗ_Итоги.Найти(СтрокаФормы.Сотрудник, "Сотрудник");
		СтрокаФормы.ПревышениеЛимита = (СтрокаИтога <> Неопределено И СтрокаИтога.КоличествоДнейВДокументе > 28);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
